[
  {
    "id": 1,
    "title": "ULIP Logixtics Hackathon 2.0",
    "date": "2024-09-25",
    "description": "ULIP Logixtics Hackathon 2.0, presented by NLDSL (NICDC Logistics Data Services Limited) in collaboration with Niti Aayog – Atal Innovation Mission and Startup India, aims to address the pressing issues of logistics sector by fostering innovation and creativity among talented individuals and teams. We invite you to join this initiative to develop groundbreaking solutions that can revolutionize the logistics landscape in India.",
    "image": "/images/onlineEvents/ULIP Logixtics Hackathon 2.0.png",
    "link": "https://hackathon.goulip.in/?utm_source=homepage&utm_medium=promotional"
  },
  {
    "id": 2,
    "title": "Sparkplug - Summer Internship 2025",
    "date": "2024-09-20",
    "description": "Sparkplug - Summer Internship 2025 is a unique online coding challenge for prospective students who want to pursue summer internships with Walmart Global Tech in India in 2025! This is a challenge designed for passionate coders who want to come experience working with the best engineering minds at Walmart Global Tech based in Bangalore/Chennai.",
    "image": "/images/onlineEvents/Sparkplug -  Summer Internship 2025.png",
    "link": "https://unstop.com/hackathons/sparkplug-summer-internship-2025-walmart-global-tech-india-1175366"
  },
  {
    "id": 3,
    "title": "Namma Yatri Software Development Engineer Hiring Challenge 2024",
    "date": "2024-09-20",
    "description": "We’re thrilled to announce that Namma Yatri is kicking off an exciting hiring challenge on HackerEarth! As a trailblazer in the mobility sector, Namma Yatri is reshaping the way people commute by empowering drivers and enhancing the passenger experience.",
    "image": "/images/onlineEvents/Namma Yatri Software Development Engineer Hiring Challenge 2024.png",
    "link": "https://assessment.hackerearth.com/challenges/new/hiring/namma-yatri-software-development-engineer-hiring-challenge-2024/"
  },
  {
    "id": 4,
    "title": "GHCI 24 Hackathon",
    "date": "2024-09-25",
    "description": "The GHCI 24 Hackathon centers on the theme of Sustainable AI, aligning with our broader conference focus on innovation for a better tomorrow. As the curtain-raiser for GHCI 24, this hackathon represents the core of our theme, Me + We, by harnessing individual creativity to tackle challenges that benefit the collective community. Participants will work to develop AI solutions that not only address present-day issues but also ensure a more sustainable and equitable future.",
    "image": "/images/onlineEvents/GHCI 24 Hackathon For Girls.png",
    "link": "https://www.hackerearth.com/challenges/hackathon/anitaborg-hackathon/"
  },
  {
    "id": 5,
    "title": "AIfor Impact APAC Hackathon",
    "date": "2024-11-17",
    "description": "The AI for Impact Hackathon, presented by Google Cloud and powered by Hack2skill, is a unique opportunity to leverage the transformative power of AI to address pressing social challenges across the APAC region. By utilizing Google’s GenAI tools, including Gemma, Gemini, Vertex AI, and Gemini Code Assist, participants will have the chance to create innovative solutions that can drive meaningful change and improve lives. By harnessing the potential of Google’s cutting-edge technologies, develop solutions that address a wide range of societal issues, from healthcare and education to sustainability and accessibility.",
    "image": "/images/onlineEvents/AIfor Impact APAC Hackathon.png",
    "link": "https://vision.hack2skill.com/event/aiforimpact_reg?utm_source=hack2skill&utm_medium=homepage"
  },
  {
    "id": 6,
    "title": "AI Driven India Hackathon 2024",
    "date": "2024-11-15",
    "description": "The AI-Driven India Hackathon is proudly organized by XLRI Jamshedpur in collaboration with Vipas.AI, empowering AI creators to create and showcase innovative AI solutions.",
    "image": "/images/onlineEvents/ai_driven_india_hackathon.png",
    "link": "https://vipas.ai/hackathon/register"
  },
  {
    "id": 7,
    "title": "Prod-E-G Hackathon 2024",
    "date": "2024-10-01",
    "description": "Use your creativity and think of amazing products that could solve any sustainability or technology-based problem. This National-Level Hackathon is designed to ignite your entrepreneurial, inventor, and problem-solving skills. This platform is open to all individuals to foster diversity and inclusion. Get ready for an exciting event ahead!",
    "image": "/images/onlineEvents/prod-e-g.png",
    "link": "https://lnkd.in/gT3_EGDu"
  },
  {
    "id": 8,
    "title": "Algorithimia 2024",
    "date": "2024-10-24",
    "description": "Algorithmia is a ICPC style contest held by IIIT Nagpur - for participants to showcase their abilities in competitive programming.",
    "image": "/images/onlineEvents/algorithimia.png",
    "link": "https://unstop.com/hackathons/algorithmia-the-icpc-style-coding-challenge-tantrafiesta24-iiit-nagpur-1152434"
  },
  {
    "id": 9,
    "title": "L'Oréal Sustainability Challenge 2024",
    "date": "2024-10-25",
    "description": "This year for the L’Oréal Sustainability Challenge we will be focusing on the PEOPLE, PLANET & PRODUCT pillars. We want to create long-term and sustainable impact and to achieve this, we want young and passionate change agents like you, to contribute to a better and more sustainable planet, while also creating a community of our consumers and supporters who can take this journey with us.",
    "image": "/images/onlineEvents/loreal_sustainability.png",
    "link": "https://unstop.com/competitions/loreal-sustainability-challenge-2024-loreal-1114541?refId=FECOM"
  },
  {
    "id": 10,
    "title": "i.mobilothon 4.0",
    "date": "2024-10-20",
    "description": "The 4th edition of i.mobilothon is here. The vision behind i.mobilothon (VWITS’ very own hackathon) has always been to fuel innovation and build product ideas that add concrete value to the Volkswagen Group. In its 4th edition, we would like to bring the i.mobilothon with its four themes right up to your working desk!",
    "image": "/images/onlineEvents/i_mobilothon.png",
    "link": "https://unstop.com/hackathons/imobilothon-40-volkswagen-group-technology-solutions-india-1172855"
  },
  {
    "id": 11,
    "title": "IdeaHub 2.0: The Ultimate Tech Challenge",
    "date": "2024-10-10",
    "description": "IdeaHub 2.0 is an ideation organized by TechCider Club as part of IGNITE 7.0, the flagship tech fest of NMIMS Navi Mumbai. This competition challenges participants to develop innovative solutions across various technology domains.",
    "image": "/images/onlineEvents/ideathon.png",
    "link": "https://unstop.com/hackathons/ideahub-20-the-ultimate-tech-challenge-nmims-navi-mumbai-1176613?utm_source=Opportunities&utm_medium=D2C-Newsletters&utm_campaign=Eng-1st-Year&ref=UnstopNewsletters"
  },
  {
      "id": 12,
      "title": "Flutter Conf India 2023",
      "date": "2023-12-09",
      "description": "Get ready to dive deep into the world of Dart and Flutter at Flutter Conf India, the country's leading conference dedicated to top-quality content.",
      "image": "/images/onlineEvents/flutterconfin.png",
      "link": "https://konfhub.com/flutterconfin"
  },
  {
      "id": 13,
    "title": "She Builds AI: Hackathon 2024",
    "date": "2024-10-09",
    "description": "Collaborate with other technologists to design and develop AI-powered solutions to help women and girls thrive during our global hackathon.",
    "image": "/images/onlineEvents/hackathonai.jpg",
    "link": "https://developers.google.com/womentechmakers/initiatives/she-builds-ai"
  },
  {
    "id": 14,
    "title": "MongoDB AI Hackathon: Code for a Cause",
    "date": "2024-10-14",
    "description": "Unleash the power of MongoDB Atlas on AWS to build solutions that make a real difference.",
    "image": "/images/onlineEvents/MongoDB-aws.png",
    "link": "https://mongodb-ai.devpost.com/"
  },
  {
    "id": 15,
    "title": "ignITe Challenge",
    "date": "2024-10-15",
    "description": "Join Asian Paints hiring challenge “ignITe” and showcase your coding skills. Compete with other tech enthusiasts and impress our team of experts.",
    "image": "/images/onlineEvents/b498e93f8a-asian_paints_banner.jpg",
    "link": "https://assessment.hackerearth.com/challenges/new/hiring/ignite-hiring-challenge/"
  },
  {
    "id": 16,
    "title": "GSK E^3 - Engaging and Exciting minds for Excellence 2024",
    "date": "2024-10-15",
    "description": "GSK Pharmaceuticals Limited is back with its riveting strategy competition, Engaging and Exciting minds for Excellence (E^3) 2024, which puts to test your expertise and out-of-the-box thinking skills in connecting with the intended audience and penetrate the market to tap potential stakeholders.",
    "image": "/images/onlineEvents/gsk2024.webp",
    "link": "https://unstop.com/competitions/gsk-e3-engaging-and-exciting-minds-for-excellence-2024-glaxosmithkline-pharmaceuticals-limited-1177561"
  },
  {
    "id": 17,
    "title": "Unstop's Got Latent",
    "date": "2024-10-15",
    "description": "Unstop is looking for individuals who wear creativity like a charm, can turn their hobby into talent, and know exactly how to put classroom lessons to use.",
    "image": "/images/onlineEvents/670e3ca72f94e_unstops-got-latent.webp",
    "link": "https://unstop.com/competitions/unstops-got-latent-unstop-1170608"
  },
  {
    "id": 18,
    "title": "Red Hat and Intel AI Hackathon",
    "date": "2024-10-15",
    "description": "Gen AI and Retrieval-Augmented Generation (RAG) is here!  This is your chance to explore the formidable combination of Intel®  Xeon® Processors with AMX (Advanced Matrix Extensions), Intel OpenVINO™, and Red Hat OpenShift AI.",
    "image": "/images/onlineEvents/full_width (1).png",
    "link": "https://redhat-intel.devpost.com/"
  },
  {
    "id": 19,
    "title": "Microsoft Fabric and AI Learning Hackathon",
    "date": "2024-10-15",
    "description": "This is your chance to dive deep into the future of AI and cloud innovation, leveraging the powerful capabilities of Microsoft Fabric and Azure OpenAI services.",
    "image": "/images/onlineEvents/Screenshot 2024-10-16 012348.png",
    "link": "https://microsoftfabric.devpost.com/"
  },
    {
    "id": 20,
  "title": "Season of AI - Season 2 - Copilots",
  "date": "2024-11-16",
  "description": "To learn Azure AI Studio - a cutting-edge 'code first' experience for building generative AI copilots along with some interesting topics.",
  "image": "/images/onlineEvents/ddd.png",
  "link": "https://www.meetup.com/pune-tech-community/events/303915867/?eventOrigin=group_upcoming_events&_gl=1*1xu42tm*_up*MQ..*_ga*NzE4NDUwMDQzLjE3MjkxMDQ2NjE.*_ga_NP82XMKW0P*MTcyOTEwNDY2MS4xLjAuMTcyOTEwNDY2MS4wLjAuMA.."
},
  {
    "id": 21,
  "title": "Implementing Responsible AI Practices in Azure AI Studio",
  "date": "2024-11-19",
  "description": "The principles of Responsible AI and their role in AI development , How Azure AI Studio utilizes content safety for ethical AI usage.",
  "image": "/images/onlineEvents/microsoftazure-featured.png",
  "link": "https://www.meetup.com/pune-tech-community/events/303917216/?eventOrigin=group_events_list"
}

]


